from datetime import date


class Room:
    """
    Базовый класс для номеров в отеле
    """
    ...


class SingleRoom:
    """
    Класс для одноместного номера
    """
    ...


class DoubleRoom:
    """
    Класс для двухместного номера
    """
    ...


class Suite:
    """
    Класс для люксового номера. Наценка 20%
    """
    ...


class Booking:
    """
    Класс для управления бронированием
    """
    ...


class Hotel:
    """
    Класс для управления отелем
    """
    ...


if __name__ == "__main__":
    # Проверьте код
    pass
