import csv
import random
from faker import Faker

# Используем Faker для генерации данных
fake = Faker()

# Заголовки для CSV-файла
header = ['Продукт', 'Сколько продано', 'Дата продажи']


# Список существующих товаров на русском языке
products = [
    "Ноутбук", "Смартфон", "Планшет", "Часы", "Наушники", "Телевизор", "Камера",
    "Монитор", "Принтер", "Микроволновка", "Холодильник", "Стиральная машина",
    "Пылесос", "Миксер", "Блендер", "Утюг", "Электрическая плита", "Кофемашина",
    "Тостер", "Гриль", "Фен", "Кондиционер", "Обогреватель", "Игровая консоль",
    "Сушилка для одежды", "Посудомоечная машина", "Умная колонка", "Электрочайник",
    "Робот-пылесос", "Электронная книга", "Зеркальная камера", "Электросамокат",
    "Смарт-лампа", "Портативная колонка", "Фитнес-браслет", "Мышь", "Клавиатура",
    "Видеорегистратор", "Внешний аккумулятор", "Проектор", "Кофеварка",
    "Геймпад", "Сетевой фильтр", "Портативный жёсткий диск", "Флеш-накопитель",
    "Звуковая панель", "Массажёр", "Триммер", "Видеокарта", "Мультиварка"
]

# Параметры генерации данных
num_rows = 5000
csv_file_path_rus = "sales_data.csv"

# Генерация данных с русскими товарами
with open(csv_file_path_rus, mode='w', newline='', encoding='utf-8') as file:
    writer = csv.writer(file)
    writer.writerow(header)

    for _ in range(num_rows):
        product_name = random.choice(products)
        units_sold = random.randint(1, 20)
        sale_date = fake.date_between(start_date='-1y', end_date='today')

        writer.writerow([product_name, units_sold, sale_date])

